Revit 2026 API

# StairsRunHeight Property

---

The calculated height of the stairs run.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Height { get; }
```
```vb
Public ReadOnly Property Height As Double
	Get
```
```cpp
public:
property double Height {
	double get ();
}
```
```fsharp
member Height : float with get
```

#### Property Value

Double

The height is the elevation span between run's base elevation and top elevation.

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace